docs/posts/2025-01-12-dot-operators-for-logical-and.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Feb 12, 2025 04:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dot Operators for Logical And</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Dot Operators for Logical And
<br />
<span class="subtitle">Jan 12, 2025 12:59</span>
</h1>
<p>
My logic textbook this semester uses a dot for &ldquo;and&rdquo; instead of an ampersand. Unfortunately, the center dot in LaTeX is too small to be easily legible. I managed to increase the size of the LaTeX cdot by using the bm package and renewing the command to  <code>\bm{\cdot}</code>. In some cases, such as social media and the web, it&rsquo;s easier to use a unicode symbol. Here are the obvious options:
</p>

<dl class="org-dl">
<dt>Dot Operator ()</dt><dd>(A ⋅ B)</dd>
<dt>Bullet Operator</dt><dd>(A ∙ B)</dd>
<dt>Bullet</dt><dd>(A • B)</dd>
</dl>

<p>
The bullet seems slightly more legible. Here&rsquo;s how it looks in a more complex formula:
</p>

<div class="org-center">
<p>
∼[A • (B ∨ C)] ⊃ (B • ∼D)
</p>
</div>

<p>
I don&rsquo;t see any downside to using the bullet.
</p>

<div class="tagline" id="org22bf1a8">
<p>
Tagged:  <a href="../tags/logic.html">Logic</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Feb 12, 2025 04:34.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
